<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"1176a81da83b537c3de34e238164fdc7bb86f372514fcc633078a972772a106f","plan_job_ref":"Job Terraform Runner #16 at https://github.com/fgc-64/aws-terraform-multiple-environments/actions/runs/10010411204","plan_out_hash":"31f1b25c43d962fd12b5f7c89fc8fe8ec22c8c3d6b02013f63ea84ef8766fb83","plan_hash":"d25334cbc798f8718ee85ff6beb24a6fc4d16364fa7fed94eba49c7d2c712031","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_user.this will be created
+   resource "aws_iam_user" "this" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "staging"
+       path          = "/"
+       tags_all      = {
+           "Environment" = "Staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "ITOps"
+           "Platform"    = "V3"
        }
+       unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Runner #16](https://github.com/fgc-64/aws-terraform-multiple-environments/actions/runs/10010411204)